update architecture diagram
